Revit 2027 API
DividedSurface.GetGridSegmentReference Method
Get a reference to a line segment connecting two adjacent grid nodes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetGridSegmentReference(
	GridNode gridNode,
	GridSegmentDirection gridSegmentDirection
)
Public Function GetGridSegmentReference (
	gridNode As GridNode,
	gridSegmentDirection As GridSegmentDirection
) As Reference
public:
Reference^ GetGridSegmentReference(
	GridNode gridNode,
	GridSegmentDirection gridSegmentDirection
)
member GetGridSegmentReference :
        gridNode : GridNode *
        gridSegmentDirection : GridSegmentDirection -> Reference
Parameters
gridNode GridNode
gridSegmentDirection GridSegmentDirection
Return Value
Reference
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ], or when the adjacent grid node specified by gridSegmentDirection is out of range.
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace